# FilterStringEquals Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringEquals Constructor
FilterStringEquals Class See Also
---
Constructs an instance of FilterStringEquals.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterStringEquals()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterStringEquals()
```

# See Also
FilterStringEquals Class
Autodesk.Revit.DB Namespace